DATA = {
    "子": {
        "20符": {
            "description": "ツモピンフ",
            "tag": "required",
            "1翻": {
                "ツモ": "no-data",
                "ロン": "no-data"
            },
            "2翻": {
                "ツモ": "400/700",
                "ロン": "no-data"
            },
            "3翻": {
                "ツモ": "700/1300",
                "ロン": "no-data"
            },
            "4翻": {
                "ツモ": "1300/2600",
                "ロン": "no-data"
            },
        },
        "25符": {
            "description": "チートイツ",
            "tag": "required",
            "1翻": {
                "ツモ": "no-data",
                "ロン": "no-data"
            },
            "2翻": {
                "ツモ": "no-data",
                "ロン": "1600"
            },
            "3翻": {
                "ツモ": "800/1600",
                "ロン": "3200"
            },
            "4翻": {
                "ツモ": "1600/3200",
                "ロン": "6400"
            },
        },
        "30符": {
            "description": "頻出",
            "tag": "required",
            "1翻": {
                "ツモ": "300/500",
                "ロン": "1000"
            },
            "2翻": {
                "ツモ": "500/1000",
                "ロン": "2000"
            },
            "3翻": {
                "ツモ": "1000/2000",
                "ロン": "3900"
            },
            "4翻": {
                "ツモ": "2000/3900",
                "ロン": "7700"
            },
        },
        "40符": {
            "description": "頻出",
            "tag": "required",
            "1翻": {
                "ツモ": "400/700",
                "ロン": "1300"
            },
            "2翻": {
                "ツモ": "700/1300",
                "ロン": "2600"
            },
            "3翻": {
                "ツモ": "1300/2600",
                "ロン": "5200"
            },
            "4翻": {
                "ツモ": "2000/4000",
                "ロン": "8000"
            },
        },
    },
    "親": {
        "20符": {
            "description": "ツモピンフ",
            "tag": "required",
            "1翻": {
                "ツモ": "no-data",
                "ロン": "no-data"
            },
            "2翻": {
                "ツモ": "700all",
                "ロン": "no-data"
            },
            "3翻": {
                "ツモ": "1300all",
                "ロン": "no-data"
            },
            "4翻": {
                "ツモ": "2600",
                "ロン": "no-data"
            },
        },
        "25符": {
            "description": "チートイツ",
            "tag": "required",
            "1翻": {
                "ツモ": "no-data",
                "ロン": "no-data"
            },
            "2翻": {
                "ツモ": "no-data",
                "ロン": "2400"
            },
            "3翻": {
                "ツモ": "1600all",
                "ロン": "4800"
            },
            "4翻": {
                "ツモ": "3200all",
                "ロン": "9600"
            },
        },
        "30符": {
            "description": "頻出",
            "tag": "required",
            "1翻": {
                "ツモ": "500all",
                "ロン": "1500"
            },
            "2翻": {
                "ツモ": "1000all",
                "ロン": "2900"
            },
            "3翻": {
                "ツモ": "2000all",
                "ロン": "5800"
            },
            "4翻": {
                "ツモ": "3900all",
                "ロン": "11600"
            },
        },
        "40符": {
            "description": "頻出",
            "tag": "required",
            "1翻": {
                "ツモ": "700all",
                "ロン": "2000"
            },
            "2翻": {
                "ツモ": "1300all",
                "ロン": "3900"
            },
            "3翻": {
                "ツモ": "2600all",
                "ロン": "7700"
            },
            "4翻": {
                "ツモ": "4000all",
                "ロン": "12000"
            },
        }
    }
}

# 親・子
PLAYER_STATUS = ["子", "親"]

# 符
SCORE_POINTS = ["20符", "25符", "30符", "40符"]

# 翻
SCORE_DOUBLE = ["1翻", "2翻", "3翻", "4翻"]

# ツモ・ロン
ATTACK_TYPE = ["ツモ", "ロン"]

NO_DATA = ["NO-DATA", "no-data", "none", "NONE", "no", "NO", "", "^[[A"]